Repository: adilemreee/cf-20-11-2025
Catalog: sonprojeee/Resources/*.lproj/Localizable.strings
Languages: tr

# Geri
source: Back
tr: Geri

# İleri
source: Next
tr: İleri

# Cloudflared Manager'a Hoşgeldiniz
source: Welcome to Cloudflared Manager
tr: Cloudflared Manager'a Hoşgeldiniz

source: Easily manage your Cloudflare tunnels, expose your MAMP projects to the internet, and track your logs.
tr: Cloudflare tünellerinizi kolayca yönetin, MAMP projelerinizi internete açın ve loglarınızı takip edin.

# Cloudflared Yapılandırması
source: Cloudflared Configuration
tr: Cloudflared Yapılandırması

# Uygulamanın çalışması için 'cloudflared' komut satırı aracı gereklidir.
source: The 'cloudflared' command-line tool is required for the app to work.
tr: Uygulamanın çalışması için 'cloudflared' komut satırı aracı gereklidir.

# Cloudflared Yolu:
source: Cloudflared Path:
tr: Cloudflared Yolu:

# Yol...
source: Path...
tr: Yol...

# Seç
source: Select
tr: Seç

# Yolu Kontrol Et
source: Check Path
tr: Yolu Kontrol Et

# Cloudflared bulundu ve çalıştırılabilir.
source: Cloudflared found and executable.
tr: Cloudflared bulundu ve çalıştırılabilir.

# Belirtilen yolda çalıştırılabilir dosya bulunamadı.
source: Executable file not found at the specified path.
tr: Belirtilen yolda çalıştırılabilir dosya bulunamadı.

# Günaydın
source: Good Morning
tr: Günaydın

# İyi Günler
source: Good Afternoon
tr: İyi Günler

# İyi Akşamlar
source: Good Evening
tr: İyi Akşamlar

# İyi Geceler
source: Good Night
tr: İyi Geceler

# Cloudflared Eksik
source: Cloudflared Missing
tr: Cloudflared Eksik

# Dikkat Gerekiyor
source: Attention Needed
tr: Dikkat Gerekiyor

# Sistem Aktif
source: System Active
tr: Sistem Aktif

# Hazır
source: Ready
tr: Hazır

# Hızlı İşlemler
source: Quick Actions
tr: Hızlı İşlemler

# Ortam Durumu
source: Environment Status
tr: Ortam Durumu

# Son Aktiviteler
source: Recent Activity
tr: Son Aktiviteler

# Tünel Oluştur
source: Create Tunnel
tr: Tünel Oluştur

# Hızlı Tünel
source: Quick Tunnel
tr: Hızlı Tünel

# Ayarlar
source: Settings
tr: Ayarlar

# Çıkış
source: Quit
tr: Çıkış

# Sistem Normal
source: System Normal
tr: Sistem Normal

# Aktif
source: Active
tr: Aktif

# Toplam
source: Total
tr: Toplam

# Hata
source: Error
tr: Hata

# MAMP Entegrasyonu
source: MAMP Integration
tr: MAMP Entegrasyonu

source: If you use MAMP, select the MAMP folder to automatically detect your projects.
tr: MAMP kullanıyorsanız, projelerinizi otomatik algılamak için MAMP klasörünü seçin.

# MAMP Ana Dizini:
source: MAMP Directory:
tr: MAMP Ana Dizini:

# MAMP Kullanmıyorum (Atla)
source: I Don't Use MAMP (Skip)
tr: MAMP Kullanmıyorum (Atla)

# Kurulum Tamamlandı!
source: Setup Complete!
tr: Kurulum Tamamlandı!

# Artık tünellerinizi oluşturmaya ve yönetmeye başlayabilirsiniz.
source: You can now start creating and managing your tunnels.
tr: Artık tünellerinizi oluşturmaya ve yönetmeye başlayabilirsiniz.

# Uygulamayı Başlat
source: Start Application
tr: Uygulamayı Başlat

# Genel
source: General
tr: Genel

# Yollar
source: Paths
tr: Yollar

# Görünüm
source: Appearance
tr: Görünüm

# Bildirimler
source: Notifications
tr: Bildirimler

# Geçmiş
source: History
tr: Geçmiş

# Yedekleme
source: Backup
tr: Yedekleme

# Gelişmiş
source: Advanced
tr: Gelişmiş

# Hakkında
source: About
tr: Hakkında

# Yapılandırma Gerekli
source: Configuration Required
tr: Yapılandırma Gerekli

# Durumu Kontrol Et
source: Check Status
tr: Durumu Kontrol Et

# Temel uygulama ayarları ve yapılandırma
source: Basic application settings and configuration
tr: Temel uygulama ayarları ve yapılandırma

# Dosya yolları ve dizin ayarları
source: File paths and directory settings
tr: Dosya yolları ve dizin ayarları

# Görünüm ve tema tercihleri
source: Appearance and theme preferences
tr: Görünüm ve tema tercihleri

# Bildirim ayarları ve tercihler
source: Notification settings and preferences
tr: Bildirim ayarları ve tercihler

# Bildirimler, hatalar ve log kayıtları
source: Notifications, errors, and logs
tr: Bildirimler, hatalar ve log kayıtları

# Yedekleme ve geri yükleme işlemleri
source: Backup and restore operations
tr: Yedekleme ve geri yükleme işlemleri

# Gelişmiş özellikler ve araçlar
source: Advanced features and tools
tr: Gelişmiş özellikler ve araçlar

# Uygulama hakkında bilgiler
source: Information about the application
tr: Uygulama hakkında bilgiler

# Yeni Yönetilen Tünel
source: New Managed Tunnel
tr: Yeni Yönetilen Tünel

# Cloudflare üzerinde yönetilen tünel oluşturun
source: Create a managed tunnel on Cloudflare
tr: Cloudflare üzerinde yönetilen tünel oluşturun

# Tünel Yapılandırması
source: Tunnel Configuration
tr: Tünel Yapılandırması

# Tünel Adı
source: Tunnel Name
tr: Tünel Adı

# Cloudflare'deki benzersiz ad
source: Unique name on Cloudflare
tr: Cloudflare'deki benzersiz ad

# Config Dosya Adı
source: Config File Name
tr: Config Dosya Adı

# Yerel .yml dosya adı
source: Local .yml file name
tr: Yerel .yml dosya adı

# Protokol
source: Protocol
tr: Protokol

# Yerel Port
source: Local Port
tr: Yerel Port

# Port numarası
source: Port number
tr: Port numarası

# MAMP Entegrasyonu (Opsiyonel)
source: MAMP Integration (Optional)
tr: MAMP Entegrasyonu (Opsiyonel)

# MAMP vHost Güncelle
source: Update MAMP vHost
tr: MAMP vHost Güncelle

# httpd-vhosts.conf ve httpd.conf dosyalarını otomatik yapılandır
source: Automatically configure httpd-vhosts.conf and httpd.conf
tr: httpd-vhosts.conf ve httpd.conf dosyalarını otomatik yapılandır

# Oluşturma Durumu
source: Creation Status
tr: Oluşturma Durumu

# Lütfen bekleyiniz...
source: Please wait...
tr: Lütfen bekleyiniz...

# İptal
source: Cancel
tr: İptal

# Oluştur
source: Create
tr: Oluştur

# Hızlı Dosya Paylaşımı
source: Quick File Sharing
tr: Hızlı Dosya Paylaşımı

# Klasör seçin ve anında internete açın
source: Select a folder and expose it to the internet instantly
tr: Klasör seçin ve anında internete açın

# Paylaşılacak Klasör
source: Folder to Share
tr: Paylaşılacak Klasör

# Klasör Yolu
source: Folder Path
tr: Klasör Yolu

# Yayında
source: Live
tr: Yayında

# Tünel oluşturuluyor...
source: Creating tunnel...
tr: Tünel oluşturuluyor...

# Paylaşımı Durdur
source: Stop Sharing
tr: Paylaşımı Durdur

# Paylaşımı Başlat
source: Start Sharing
tr: Paylaşımı Başlat

# Paylaşılacak Klasörü Seçin
source: Select Folder to Share
tr: Paylaşılacak Klasörü Seçin

# Hızlı tünel başlatılamadı
source: Quick tunnel could not be started
tr: Hızlı tünel başlatılamadı

# Özel
source: Custom
tr: Özel

# Özel URL girin
source: Enter custom URL
tr: Özel URL girin

# Hızlı Tünel Başlat
source: Start Quick Tunnel
tr: Hızlı Tünel Başlat

# Yerel sunucunuzu hızlıca internete açın
source: Expose your local server to the internet quickly
tr: Yerel sunucunuzu hızlıca internete açın

# Tamam
source: OK
tr: Tamam

# Hızlı Seçim
source: Quick Selection
tr: Hızlı Seçim

# Yaygın Sunucu Türleri
source: Common Server Types
tr: Yaygın Sunucu Türleri

# Preset'i sil
source: Delete Preset
tr: Preset'i sil

# Özel Preset Ekle
source: Add Custom Preset
tr: Özel Preset Ekle

# Ad
source: Name
tr: Ad

# örn. Laravel
source: e.g. Laravel
tr: örn. Laravel

# Açıklama
source: Description
tr: Açıklama

# Yerel geliştirme sunucusu
source: Local development server
tr: Yerel geliştirme sunucusu

# Preset Ekle
source: Add Preset
tr: Preset Ekle

# URL Yapılandırması
source: URL Configuration
tr: URL Yapılandırması

# Yerel URL
source: Local URL
tr: Yerel URL

# Geçerli URL formatı
source: Valid URL format
tr: Geçerli URL formatı

# Geçersiz URL formatı
source: Invalid URL format
tr: Geçersiz URL formatı

# Nasıl Çalışır?
source: How it Works?
tr: Nasıl Çalışır?

source: Quick tunnels create temporary URLs and expire automatically when your server stops. For persistent tunnels, create a 'Managed Tunnel'.
tr: Hızlı tüneller geçici URL'ler oluşturur ve sunucunuz kapandığında otomatik olarak sona erer. Kalıcı tüneller için 'Yönetilen Tünel' oluşturun.

# Başlatma Durumu
source: Startup Status
tr: Başlatma Durumu

# İşlem devam ediyor...
source: Processing...
tr: İşlem devam ediyor...

# cloudflared komutu hazırlanıyor...
source: Preparing cloudflared command...
tr: cloudflared komutu hazırlanıyor...

# URL hazır olduğunda bu sayfada göreceksiniz.
source: You will see the URL here when ready.
tr: URL hazır olduğunda bu sayfada göreceksiniz.

# Tüneli Durdur
source: Stop Tunnel
tr: Tüneli Durdur

# Tüneli Başlat
source: Start Tunnel
tr: Tüneli Başlat

# Lütfen geçerli bir yerel URL girin. Örnek: http://localhost:3000
source: Please enter a valid local URL. Example: http://localhost:3000
tr: Lütfen geçerli bir yerel URL girin. Örnek: http://localhost:3000

# Hızlı tünel başlatılıyor...
source: Starting quick tunnel...
tr: Hızlı tünel başlatılıyor...

# URL hazırlanıyor...
source: Preparing URL...
tr: URL hazırlanıyor...

# Hata oluştu.
source: An error occurred.
tr: Hata oluştu.

# Tünel hazır.
source: Tunnel ready.
tr: Tünel hazır.

# Tünel beklenmedik şekilde sonlandı.
source: Tunnel terminated unexpectedly.
tr: Tünel beklenmedik şekilde sonlandı.

# preset'i eklendi.
source: preset added.
tr: preset'i eklendi.

# preset'i silindi.
source: preset deleted.
tr: preset'i silindi.

# Tünel durduruluyor...
source: Stopping tunnel...
tr: Tünel durduruluyor...

# Genel URL
source: Public URL
tr: Genel URL

# Tünel çalışıyor
source: Tunnel is running
tr: Tünel çalışıyor

# Kopyala
source: Copy
tr: Kopyala

# Tarayıcıda Aç
source: Open in Browser
tr: Tarayıcıda Aç

# Tünel Hatası
source: Tunnel Error
tr: Tünel Hatası

# Hızlı tünel başlatılamadı veya sonlandırıldı
source: Quick tunnel could not be started or was terminated
tr: Hızlı tünel başlatılamadı veya sonlandırıldı

# Tekrar Dene
source: Try Again
tr: Tekrar Dene

# Modern Tünel Yönetim Aracı
source: Modern Tunnel Management Tool
tr: Modern Tünel Yönetim Aracı

# cloudflared hazır
source: cloudflared ready
tr: cloudflared hazır

# cloudflared eksik
source: cloudflared missing
tr: cloudflared eksik

# MAMP Dizini
source: MAMP Directory
tr: MAMP Dizini

# Gösterge Paneli
source: Dashboard
tr: Gösterge Paneli

# Tünelleri ve durum özetini tek ekranda takip edin
source: Monitor tunnels and status summary on a single screen
tr: Tünelleri ve durum özetini tek ekranda takip edin

# Hızlı Tünel Oluştur
source: Create Quick Tunnel
tr: Hızlı Tünel Oluştur

# Yerel projelerinizi saniyeler içinde paylaşın
source: Share your local projects in seconds
tr: Yerel projelerinizi saniyeler içinde paylaşın

# Ayarları Yapılandır
source: Configure Settings
tr: Ayarları Yapılandır

# cloudflared, MAMP ve diğer yolları özelleştirin
source: Customize cloudflared, MAMP and other paths
tr: cloudflared, MAMP ve diğer yolları özelleştirin

# Temel Bilgiler
source: Basic Information
tr: Temel Bilgiler

# Durum Kontrol Aralığı
source: Status Check Interval
tr: Durum Kontrol Aralığı

# Başlangıç Kontrol Listesi
source: Startup Checklist
tr: Başlangıç Kontrol Listesi

# cloudflared yolunu doğrulayın
source: Verify cloudflared path
tr: cloudflared yolunu doğrulayın

# Hepsi hazır.
source: All set.
tr: Hepsi hazır.

# Ayarlar'dan farklı bir yol seçebilirsiniz.
source: You can choose a different path in Settings.
tr: Ayarlar'dan farklı bir yol seçebilirsiniz.

# Kontrol Et
source: Check
tr: Kontrol Et

# cloudflared yolu kontrol ediliyor...
source: Checking cloudflared path...
tr: cloudflared yolu kontrol ediliyor...

# Cloudflare hesabınıza giriş yapın
source: Log in to your Cloudflare account
tr: Cloudflare hesabınıza giriş yapın

# Tarayıcıda açılan pencereyi takip edin.
source: Follow the window opened in your browser.
tr: Tarayıcıda açılan pencereyi takip edin.

# Giriş Yap
source: Log In
tr: Giriş Yap

# MAMP proje klasörünü kontrol edin
source: Check MAMP project folder
tr: MAMP proje klasörünü kontrol edin

# MAMP dizini bulundu.
source: MAMP directory found.
tr: MAMP dizini bulundu.

# MAMP dizini bulunamadı, yolu Ayarlar'dan güncelleyin.
source: MAMP directory not found, update path in Settings.
tr: MAMP dizini bulunamadı, yolu Ayarlar'dan güncelleyin.

# Klasörü Aç
source: Open Folder
tr: Klasörü Aç

# Hazırım, Devam Et
source: I'm Ready, Continue
tr: Hazırım, Devam Et

# Uygulama menü çubuğunda çalışmaya devam edecek
source: The application will continue running in the menu bar
tr: Uygulama menü çubuğunda çalışmaya devam edecek

# Gösterge Paneli açılıyor...
source: Opening Dashboard...
tr: Gösterge Paneli açılıyor...

# Hızlı tünel penceresi açılıyor...
source: Opening Quick Tunnel window...
tr: Hızlı tünel penceresi açılıyor...

# Ayarlar penceresi açıldı.
source: Settings window opened.
tr: Ayarlar penceresi açıldı.

# MAMP dizini Finder'da açıldı.
source: MAMP directory opened in Finder.
tr: MAMP dizini Finder'da açıldı.

# Cloudflare giriş kontrolü başlatıldı...
source: Cloudflare login check started...
tr: Cloudflare giriş kontrolü başlatıldı...

# cloudflared bulunamadı: %@
source: cloudflared not found: %@
tr: cloudflared bulunamadı: %@

# Giriş Başlatıldı
source: Login Started
tr: Giriş Başlatıldı

# Cloudflare giriş işlemi için tarayıcı açılıyor...
source: Opening browser for Cloudflare login...
tr: Cloudflare giriş işlemi için tarayıcı açılıyor...

# Giriş Başarılı
source: Login Successful
tr: Giriş Başarılı

# Cloudflare hesabına başarıyla giriş yapıldı.
source: Successfully logged in to Cloudflare account.
tr: Cloudflare hesabına başarıyla giriş yapıldı.

# Cloudflare girişinde bilinmeyen hata (Kod: %d)
source: Unknown error during Cloudflare login (Code: %d)
tr: Cloudflare girişinde bilinmeyen hata (Kod: %d)

# Process başlatılamadı: %@
source: Process could not be started: %@
tr: Process başlatılamadı: %@

# İnternet Bağlantısı Yok
source: No Internet Connection
tr: İnternet Bağlantısı Yok

# Hızlı tünel başlatılamadı. Lütfen internet bağlantınızı kontrol edin.
source: Quick tunnel could not be started. Please check your internet connection.
tr: Hızlı tünel başlatılamadı. Lütfen internet bağlantınızı kontrol edin.

# İnternet bağlantısı yok.
source: No internet connection.
tr: İnternet bağlantısı yok.

# Geçersiz yerel URL formatı. (örn: http://localhost:8000)
source: Invalid local URL format. (e.g. http://localhost:8000)
tr: Geçersiz yerel URL formatı. (örn: http://localhost:8000)
